В 21ХX году в результате масштабной катастрофы неизвестного происхождения всё восприятие окружающей реальности превратилось в набор букв и символов.
Глаза больше не видели пейзажей и объекты - теперь каждое живое существо воспринимало мир как набор слов, описывающих окружающее пространство.
Слова собирались в осмысленный текст, словно жизнь каждого человека вёл неизвестный рассказчик.

Прошло несколько десятков лет.
Причины столь странной катастрофы всё ещё доподлинно не ясны: был ли это неудачный научный эксперимент, вторжение иномирцев или божья кара.

Ясно одно - мир уже больше не станет прежним...